src/Documents/ИС_Сбер_Отправление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_Сбер_Отправление</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>orderCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>confirmedTimeLimit</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>packingTimeLimit</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shippingTimeLimit</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentDateShift</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shipmentIsChangeable</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customerFullName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customerAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>shippingPoint</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryDateFrom</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryDateTo</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>status</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_Сбер_СтатусыОтправлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryMethodId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>serviceScheme</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>customer</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>depositedAmount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>items</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>itemIndex</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>status</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИС_Сбер_СтатусыОтправлений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>subStatus</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИС_Сбер_ДетализацияСтатусовОтмены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>finalPrice</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>offerId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>goodsId</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>digitalMark</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>boxIndex</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураМегаМаркета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПередачаТоваровХранителю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПередачаТоваровХранителю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ИС_MP_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ИС_MP_Настройки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛичныйКабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаказовКлиентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Характеристики</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
						<v8:Type>cfg:EnumRef.ВариантыОбеспечения</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовКлиентов</v8:Type>
						<v8:Type>cfg:EnumRef.ИС_Ozon_ЗначениеАртикулаПоУмолчанию</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Documents/ИС_Сбер_Отправление/Forms/ФормаДействийПоОтправлениям/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

//+ ИнфоСофт Ивонин К.А. 13.02.24 УА #67209
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Не Параметры.Свойство("Действие") Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнено действие");
		Возврат;
	КонецЕсли;
	
	Действие = Параметры.Действие;
	
	Если Параметры.Свойство("Профиль") Тогда
		Профиль = Параметры.Профиль;
	КонецЕсли;
	
	Если Параметры.Свойство("МассивОтправлений") И ТипЗнч(Параметры.МассивОтправлений) = Тип("Массив") Тогда
		ЗаполнитьТаблицуЛотов(Параметры.МассивОтправлений);
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 13.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеФормой();
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 20.05.24 УА #75485
&НаКлиенте
Процедура ТаблицаЛотовНомерЗаказаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаЛотов.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНомерКороба(ТекДанные);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.05.24 УА #75485

//+ ИнфоСофт Ивонин К.А. 20.05.24 УА #75485
&НаКлиенте
Процедура ТаблицаЛотовНомерКоробаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаЛотов.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьНомерКороба(ТекДанные);
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.05.24 УА #75485

#КонецОбласти

#Область ОбработчикиКомандФормы

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Профиль) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не выбран ""Профиль""", , , "Профиль");
		Возврат;
	КонецЕсли;
	
	Если Действие = "Подтвердить" Тогда
	    
	    // На этапе подтверждения можно не указывать номера заказов
		//Для Каждого Строка Из ТаблицаЛотов Цикл          		
		//	Если Не ЗначениеЗаполнено(Строка.НомерЗаказа) Тогда
		//	    ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен ""Номер заказа""", , "ТаблицаЛотов[" + Строка.ПолучитьИдентификатор() + "].НомерЗаказа");
		//		Возврат;
		//	КонецЕсли;
		//
		//КонецЦикла;
		
	ИначеЕсли Действие = "Скомплектовать" Тогда
	
		Для Каждого Строка Из ТаблицаЛотов Цикл          		
			
			Если Не ЗначениеЗаполнено(Строка.НомерЗаказа) Тогда
			    ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен ""Номер заказа""", , "ТаблицаЛотов[" + Строка.ПолучитьИдентификатор() + "].НомерЗаказа");
				Возврат;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Строка.НомерКороба) Тогда
			    ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнен ""Номер короба""", , "ТаблицаЛотов[" + Строка.ПолучитьИдентификатор() + "].НомерКороба");
				Возврат;
			КонецЕсли;
		
		КонецЦикла; 
		
	ИначеЕсли Действие = "Отгрузить" Тогда
	
		Если Не ЗначениеЗаполнено(ДатаОтгрузки) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена ""Дата отгрузки""", , , "ДатаОтгрузки");
			Возврат;
		КонецЕсли;
	
	ИначеЕсли Действие = "Отменить" Тогда
	
		Если Не ЗначениеЗаполнено(ПричинаОтмены) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена ""Причина Отмены""", , , "ПричинаОтмены");
			Возврат;
		КонецЕсли;	

	КонецЕсли;
	
	ВыполнитьДействиеНаСервере();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 19.02.24 УА #67209
&НаКлиенте
Процедура РазбитьНаКороба(Команда)
	
	ТекДанные = Элементы.ТаблицаЛотов.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВводЧисла(Новый ОписаниеОповещения("РазбитьНаКоробаЗавершение", ЭтотОбъект), 2, "Количество коробов", 3, 0);
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.24 УА #67209

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
&НаСервере   
Процедура ЗаполнитьТаблицуЛотов(МассивОтправлений)
	                                             	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_MP_Настройки.Значение КАК Значение
	|ПОМЕСТИТЬ ВТ_ИдКабинета
	|ИЗ
	|	Справочник.ИС_MP_Настройки КАК ИС_MP_Настройки
	|ГДЕ
	|	ИС_MP_Настройки.ЛичныйКабинет = &Профиль
	|	И ИС_MP_Настройки.Наименование = ""СберИдКабинета""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИС_Сбер_Отправлениеitems.Ссылка КАК Отправление,
	|	ИС_Сбер_Отправлениеitems.Ссылка.Номер КАК Номер,
	|	ИС_Сбер_Отправлениеitems.itemIndex КАК ПорядковыйНомер,
	|	ИС_Сбер_Отправлениеitems.offerId КАК Артикул,
	|	ИС_Сбер_Отправлениеitems.НоменклатураМегаМаркета КАК НоменклатураМегаМаркета,
	|	ИС_Сбер_Отправлениеitems.Ссылка.Заказ.Номер КАК ЗаказНомер,
	|	ИС_Сбер_Отправлениеitems.Ссылка.orderCode КАК orderCode,
	|   ИС_Сбер_Отправлениеitems.itemIndex КАК НомерКороба,
	|	ВТ_ИдКабинета.Значение КАК ИдКабинета
	|ИЗ
	|	Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИдКабинета КАК ВТ_ИдКабинета
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ИС_Сбер_Отправлениеitems.Ссылка В(&Ссылка)";
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Ссылка", МассивОтправлений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОтправлений = РезультатЗапроса.Выбрать(); 
	
	//+ ИнфоСофт Сумин Д.В. 19.02.2024 УА #62568	
	Если Действие = "Скомплектовать" Тогда
		КодыМаркировкиТЗ = ПолучитьКодыМаркировкиОтправлений(МассивОтправлений);	
	КонецЕсли;	
	//- ИнфоСофт Сумин Д.В. 19.02.2024 УА #62568
	
	Пока ВыборкаОтправлений.Следующий() Цикл
    
    	НоваяСтрока = ТаблицаЛотов.Добавить();
    	ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаОтправлений);
    	
    	Если Действие = "Скомплектовать" Или Действие = "Отгрузить" Тогда
		
			НоваяСтрока.НомерЗаказа = ВыборкаОтправлений.orderCode;
			НоваяСтрока.КодКороба = СтрШаблон("%1*%2*%3", ВыборкаОтправлений.ИдКабинета, 
				ВыборкаОтправлений.orderCode, ВыборкаОтправлений.НомерКороба);
			
			//+ ИнфоСофт Сумин Д.В. 19.02.2024 УА #62568	
			Если Действие = "Скомплектовать" Тогда
				Для Каждого Строка Из КодыМаркировкиТЗ Цикл
					Если Строка.СберОтправление = НоваяСтрока.Отправление И Строка.НоменклатураМегаМаркета = НоваяСтрока.НоменклатураМегаМаркета Тогда
						НоваяСтрока.КодМаркировки = Строка.ЗначениеШтрихкода; 
						КодыМаркировкиТЗ.Удалить(Строка);
						Прервать;
					КонецЕсли;	
				КонецЦикла;	
			КонецЕсли;	
			//- ИнфоСофт Сумин Д.В. 19.02.2024 УА #62568
		
		Иначе
			
			Если ЗначениеЗаполнено(ВыборкаОтправлений.ЗаказНомер) Тогда
				МассивЭлементов = СтрРазделить(ВыборкаОтправлений.ЗаказНомер, "-");
				НоваяСтрока.НомерЗаказа = СтрШаблон("%1%2", 
				Формат(Год(ТекущаяДатаСеанса()), "ЧГ=0"), МассивЭлементов[МассивЭлементов.ВГраница()]);
	    	КонецЕсли;
    	
    	КонецЕсли;
    	
	КонецЦикла;
	
	ДатаОтгрузки = ТекущаяДатаСеанса();
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 20.05.24 УА #75485
&НаКлиенте
Процедура ОбновитьНомерКороба(ТекДанные)

	ТекДанные.КодКороба = СтрШаблон("%1*%2*%3", ТекДанные.ИдКабинета, 
		ТекДанные.НомерЗаказа, ТекДанные.НомерКороба);

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 20.05.24 УА #75485

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
&НаКлиенте
Процедура УправлениеФормой()
    
    Элементы.ПричинаОтмены.Видимость = Ложь;
    Элементы.ТаблицаЛотовНомерЗаказа.Видимость = Ложь;
    Элементы.ТаблицаЛотовНомерКороба.Видимость = Ложь;
    Элементы.ТаблицаЛотовКодКороба.Видимость = Ложь;
    Элементы.ТаблицаЛотовКодМаркировки.Видимость = Ложь;
    Элементы.ТаблицаЛотовРазбитьНаКороба.Видимость = Ложь;
    Элементы.ДатаОтгрузки.Видимость = Ложь;
    
	Если Действие = "Подтвердить" Тогда
		Заголовок = "Подтверждение лотов";
		Элементы.ТаблицаЛотовНомерЗаказа.Видимость = Истина;
		Элементы.ФормаВыполнитьДействие.Заголовок = "Подтвердить лоты";
	ИначеЕсли Действие = "Скомплектовать" Тогда
		Заголовок = "Комлектация лотов";
		Элементы.ТаблицаЛотовНомерЗаказа.Видимость = Истина;
		Элементы.ТаблицаЛотовНомерКороба.Видимость = Истина;
		Элементы.ТаблицаЛотовКодКороба.Видимость = Истина;
		Элементы.ТаблицаЛотовКодМаркировки.Видимость = Истина;
		Элементы.ТаблицаЛотовРазбитьНаКороба.Видимость = Истина;
		Элементы.ФормаВыполнитьДействие.Заголовок = "Комплектовать лоты";		
	ИначеЕсли Действие = "Отгрузить" Тогда
		Заголовок = "Отгрузка лотов";
		Элементы.ДатаОтгрузки.Видимость = Истина;
		Элементы.ФормаВыполнитьДействие.Заголовок = "Отгрузить лоты";
	ИначеЕсли Действие = "Отменить" Тогда
		Заголовок = "Отмена лотов";
		Элементы.ПричинаОтмены.Видимость = Истина;
		Элементы.ФормаВыполнитьДействие.Заголовок = "Отменить лоты";
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 17.02.24 УА #67209
&НаСервере   
Процедура ВыполнитьДействиеНаСервере()

	Если Действие = "Подтвердить" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Номер КАК Номер,
		|	ТЧ.НомерЗаказа КАК НомерЗаказа,
		|	ТЧ.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ТЧ.Артикул КАК Артикул
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧ.Номер КАК Номер,
		|	ВТ_ТЧ.НомерЗаказа КАК НомерЗаказа,
		|	ВТ_ТЧ.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ВТ_ТЧ.Артикул КАК Артикул
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|ИТОГИ ПО
		|	Номер,
		|	НомерЗаказа";

		Запрос.УстановитьПараметр("ТЧ", ТаблицаЛотов.Выгрузить(, "Номер, ПорядковыйНомер, Артикул, НомерЗаказа"));
				
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивShipments = Новый Массив;
		
		Пока ВыборкаНомер.Следующий() Цикл
            
            СтруктураShipment = Новый Структура;
		    СтруктураShipment.Вставить("shipmentId", ВыборкаНомер.Номер);
		
			ВыборкаНомерЗаказа = ВыборкаНомер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
			Пока ВыборкаНомерЗаказа.Следующий() Цикл
				
				СтруктураShipment.Вставить("orderCode", ВыборкаНомерЗаказа.НомерЗаказа);
						
				МассивItems = Новый Массив;
				ВыборкаЛотов = ВыборкаНомерЗаказа.Выбрать();
		
				Пока ВыборкаЛотов.Следующий() Цикл
                
	                СтруктураItem = Новый Структура;
	                СтруктураItem.Вставить("itemIndex", ВыборкаЛотов.ПорядковыйНомер);
	                СтруктураItem.Вставить("offerId", ВыборкаЛотов.Артикул);
	            
	            	МассивItems.Добавить(СтруктураItem);
            
				КонецЦикла;
			
				СтруктураShipment.Вставить("items", МассивItems);
			
			КонецЦикла;
		
			МассивShipments.Добавить(СтруктураShipment);
			
		КонецЦикла;
				
		ИС_Сбер_Сервер.ПодтвердитьЛоты(Профиль, МассивShipments);
		
	ИначеЕсли Действие = "Скомплектовать" Тогда	
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Номер КАК Номер,
		|	ТЧ.НомерЗаказа КАК НомерЗаказа,
		|	ТЧ.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ТЧ.Артикул КАК Артикул,
		|	ТЧ.НомерКороба КАК НомерКороба,
		|	ТЧ.КодКороба КАК КодКороба,
		|	ТЧ.КодМаркировки КАК КодМаркировки
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧ.Номер КАК Номер,
		|	ВТ_ТЧ.НомерЗаказа КАК НомерЗаказа,
		|	ВТ_ТЧ.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ВТ_ТЧ.Артикул КАК Артикул,
		|	ВТ_ТЧ.НомерКороба КАК НомерКороба,
		|	ВТ_ТЧ.КодКороба КАК КодКороба,
		|	ВТ_ТЧ.КодМаркировки КАК КодМаркировки
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|ИТОГИ ПО
		|	Номер,
		|	НомерЗаказа";

		Запрос.УстановитьПараметр("ТЧ", ТаблицаЛотов.Выгрузить( , 
			"Номер, ПорядковыйНомер, Артикул, НомерЗаказа, НомерКороба, КодКороба, КодМаркировки"));
				
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивShipments = Новый Массив;
		
		Пока ВыборкаНомер.Следующий() Цикл
            
            СтруктураShipment = Новый Структура;
		    СтруктураShipment.Вставить("shipmentId", ВыборкаНомер.Номер);
		
			ВыборкаНомерЗаказа = ВыборкаНомер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
			Пока ВыборкаНомерЗаказа.Следующий() Цикл
				
				СтруктураShipment.Вставить("orderCode", ВыборкаНомерЗаказа.НомерЗаказа);
						
				МассивItems = Новый Массив;
				ВыборкаЛотов = ВыборкаНомерЗаказа.Выбрать();
		
				Пока ВыборкаЛотов.Следующий() Цикл
                
	                СтруктураItem = Новый Структура;
	                СтруктураItem.Вставить("itemIndex", ВыборкаЛотов.ПорядковыйНомер);
					
					МассивBoxes = Новый Массив;
					
					СтруктураBoxes = Новый Структура;
					СтруктураBoxes.Вставить("boxIndex", Формат(ВыборкаЛотов.НомерКороба, "ЧГ=0"));
					СтруктураBoxes.Вставить("boxCode", ВыборкаЛотов.КодКороба);
					
					МассивBoxes.Добавить(СтруктураBoxes);
					СтруктураItem.Вставить("boxes", МассивBoxes);
					
					Если ЗначениеЗаполнено(ВыборкаЛотов.КодМаркировки) Тогда
						СтруктураItem.Вставить("digitalMark", ВыборкаЛотов.КодМаркировки);
					КонецЕсли;
						            
	            	МассивItems.Добавить(СтруктураItem);
            
				КонецЦикла;
			
				СтруктураShipment.Вставить("items", МассивItems);
			
			КонецЦикла;
		
			МассивShipments.Добавить(СтруктураShipment);
			
		КонецЦикла;
				
		ИС_Сбер_Сервер.СкомплектоватьЛоты(Профиль, МассивShipments);
		
	ИначеЕсли Действие = "Отгрузить" Тогда	
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Номер КАК Номер,
		|	ТЧ.НомерКороба КАК НомерКороба,
		|	ТЧ.КодКороба КАК КодКороба
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧ.Номер КАК Номер,
		|	ВТ_ТЧ.НомерКороба КАК НомерКороба,
		|	ВТ_ТЧ.КодКороба КАК КодКороба
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|ИТОГИ ПО
		|	Номер";

		Запрос.УстановитьПараметр("ТЧ", ТаблицаЛотов.Выгрузить( , 
			"Номер, НомерКороба, КодКороба"));
				
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивShipments = Новый Массив;
		
		Пока ВыборкаНомер.Следующий() Цикл
            
            СтруктураShipment = Новый Структура;
		    СтруктураShipment.Вставить("shipmentId", ВыборкаНомер.Номер);
						
			ВыборкаЛотов = ВыборкаНомер.Выбрать();
			
			//+ ИнфоСофт Стояк Ю.К. 03.10.2024 УА #84840
			МассивBoxes = Новый Массив;
			//- ИнфоСофт Стояк Ю.К. 03.10.2024 УА #84840
	
			Пока ВыборкаЛотов.Следующий() Цикл							
				
				//+ ИнфоСофт Стояк Ю.К. 03.10.2024 УА #84840				
				//МассивBoxes = Новый Массив;               
				//- ИнфоСофт Стояк Ю.К. 03.10.2024 УА #84840
				
				СтруктураBoxes = Новый Структура;
				СтруктураBoxes.Вставить("boxIndex", Формат(ВыборкаЛотов.НомерКороба, "ЧГ=0"));
				СтруктураBoxes.Вставить("boxCode", ВыборкаЛотов.КодКороба);
				
				МассивBoxes.Добавить(СтруктураBoxes);
				        
			КонецЦикла;
			
			СтруктураShipment.Вставить("boxes", МассивBoxes);
			
			СтруктураShipping = Новый Структура;
			СтруктураShipping.Вставить("shippingDate", 
				ИС_MP_РаботаСHTTPЗапросамиСервер.ЗаписатьДатуВJSON(ДатаОтгрузки, ФорматДатыJSON.ISO, ВариантЗаписиДатыJSON.УниверсальнаяДата));
			СтруктураShipment.Вставить("shipping", СтруктураShipping);
			
			МассивShipments.Добавить(СтруктураShipment);
			
		КонецЦикла;
				
		ИС_Сбер_Сервер.ОтгрузитьЛоты(Профиль, МассивShipments);
	
	ИначеЕсли Действие = "Отменить" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧ.Номер КАК Номер,
		|	ТЧ.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ТЧ.Артикул КАК Артикул
		|ПОМЕСТИТЬ ВТ_ТЧ
		|ИЗ
		|	&ТЧ КАК ТЧ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТЧ.Номер КАК Номер,
		|	ВТ_ТЧ.ПорядковыйНомер КАК ПорядковыйНомер,
		|	ВТ_ТЧ.Артикул КАК Артикул
		|ИЗ
		|	ВТ_ТЧ КАК ВТ_ТЧ
		|ИТОГИ ПО
		|	Номер";
		
		Запрос.УстановитьПараметр("ТЧ", ТаблицаЛотов.Выгрузить(, "Номер, ПорядковыйНомер, Артикул"));
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаНомер = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивShipments = Новый Массив;
		
		Пока ВыборкаНомер.Следующий() Цикл
		    
		    СтруктураShipment = Новый Структура;
		    СтруктураShipment.Вставить("shipmentId", ВыборкаНомер.Номер);
		    
		    МассивItems = Новый Массив;
		    
			ВыборкаЛотов = ВыборкаНомер.Выбрать();
		
			Пока ВыборкаЛотов.Следующий() Цикл
                
                СтруктураItem = Новый Структура;
                СтруктураItem.Вставить("itemIndex", ВыборкаЛотов.ПорядковыйНомер);
                СтруктураItem.Вставить("offerId", ВыборкаЛотов.Артикул);
            
            	МассивItems.Добавить(СтруктураItem);
            
			КонецЦикла;
			
			СтруктураShipment.Вставить("items", МассивItems);
			МассивShipments.Добавить(СтруктураShipment);
			
		КонецЦикла;
		
		СтруктураReason = Новый Структура;
		СтруктураReason.Вставить("type", Строка(XMLСтрока(ПричинаОтмены)));
		
		ИС_Сбер_Сервер.ОтменитьЛоты(Профиль, МассивShipments, СтруктураReason);
		
	КонецЕсли;	
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 17.02.24 УА #67209

//+ ИнфоСофт Ивонин К.А. 19.02.24 УА #67029
&НаКлиенте
Процедура РазбитьНаКоробаЗавершение(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Или Результат < 2 Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные = Элементы.ТаблицаЛотов.ТекущиеДанные;
	
	Для Итер = 2 По Результат Цикл
		
		НоваяСтрока = ТаблицаЛотов.Вставить(Элементы.ТаблицаЛотов.ТекущаяСтрока);
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекДанные);
		НоваяСтрока.НомерКороба	= Итер;
    	НоваяСтрока.КодКороба = СтрШаблон("%1*%2*%3", НоваяСтрока.ИдКабинета, 
			НоваяСтрока.orderCode, НоваяСтрока.НомерКороба);
		
	КонецЦикла;
                   
	ТаблицаЛотов.Сортировать("НомерЗаказа, НомерКороба");
                   
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 19.02.24 УА #67029

//+ ИнфоСофт Сумин Д.В. 19.02.2024 УА #62568
&НаСервере
Функция ПолучитьКодыМаркировкиОтправлений(МассивОтправлений)
	
	Запрос = Новый Запрос;
	
	//+ ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	//+ ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
	//Если ИС_MP_Сервер.ПолучитьВерсиюБезРедакции() >= "5.19.44" Тогда
	ВерсияБезРедации = ИС_МП_Сервер.ВерсияБезРедакции();
	
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсииБезНомераСборки(ВерсияБезРедации, "5.19.44") >= 0 Тогда
	//- ИнфоСофт Ивонин К.А. 04.02.25 УА #92887
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Сбер_Отправление.Ссылка КАК СберОтправление,
		|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ИС_Сбер_Отправлениеitems.НоменклатураМегаМаркета КАК НоменклатураМегаМаркета
		|ПОМЕСТИТЬ ВТ_ОсновныеДанные
		|ИЗ
		|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО (ИС_Сбер_Отправление.Заказ = ЗаказКлиентаТовары.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
		|		ПО (ИС_Сбер_Отправление.Ссылка = ИС_Сбер_Отправлениеitems.Ссылка)
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
		|	И ИС_Сбер_Отправление.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
		|	ВТ_ОсновныеДанные.Характеристика КАК Характеристика,
		|	ВТ_ОсновныеДанные.НоменклатураМегаМаркета КАК НоменклатураМегаМаркета,
		|	РеализацияТоваровУслугТовары.Ссылка КАК РТУ,
		|	ВТ_ОсновныеДанные.СберОтправление КАК СберОтправление
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО ВТ_ОсновныеДанные.ЗаказКлиента = РеализацияТоваровУслугТовары.ЗаказКлиента
		|ГДЕ
		|	РеализацияТоваровУслугТовары.ЗаказКлиента В
		|			(ВЫБРАТЬ
		|				ВТ_ОсновныеДанные.ЗаказКлиента КАК ЗаказКлиента
		|			ИЗ
		|				ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанные.Номенклатура,
		|	ВТ_ОсновныеДанные.Характеристика,
		|	ВТ_ОсновныеДанные.НоменклатураМегаМаркета,
		|	ПередачаТоваровХранителюТовары.Ссылка,
		|	ВТ_ОсновныеДанные.СберОтправление
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.Товары КАК ПередачаТоваровХранителюТовары
		|		ПО ВТ_ОсновныеДанные.ЗаказКлиента = ПередачаТоваровХранителюТовары.ЗаказКлиента
		|ГДЕ
		|	ПередачаТоваровХранителюТовары.ЗаказКлиента В
		|			(ВЫБРАТЬ
		|				ВТ_ОсновныеДанные.ЗаказКлиента КАК ЗаказКлиента
		|			ИЗ
		|				ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РТУ.СберОтправление КАК СберОтправление,
		|	ВТ_РТУ.НоменклатураМегаМаркета КАК НоменклатураМегаМаркета,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|		ПО ВТ_РТУ.РТУ = РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка
		|			И ВТ_РТУ.Номенклатура = РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура
		|			И ВТ_РТУ.Характеристика = РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика
		|ГДЕ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_РТУ.РТУ КАК РТУ
		|			ИЗ
		|				ВТ_РТУ КАК ВТ_РТУ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_РТУ.СберОтправление,
		|	ВТ_РТУ.НоменклатураМегаМаркета,
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПередачаТоваровХранителю.ШтрихкодыУпаковок КАК ПередачаТоваровХранителюШтрихкодыУпаковок
		|		ПО ВТ_РТУ.РТУ = ПередачаТоваровХранителюШтрихкодыУпаковок.Ссылка
		|			И ВТ_РТУ.Номенклатура = ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура
		|			И ВТ_РТУ.Характеристика = ПередачаТоваровХранителюШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика
		|ГДЕ
		|	ПередачаТоваровХранителюШтрихкодыУпаковок.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_РТУ.РТУ КАК РТУ
		|			ИЗ
		|				ВТ_РТУ КАК ВТ_РТУ)";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИС_Сбер_Отправление.Ссылка КАК СберОтправление,
		|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента,
		|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
		|	ЗаказКлиентаТовары.Характеристика КАК Характеристика,
		|	ИС_Сбер_Отправлениеitems.НоменклатураМегаМаркета КАК НоменклатураМегаМаркета
		|ПОМЕСТИТЬ ВТ_ОсновныеДанные
		|ИЗ
		|	Документ.ИС_Сбер_Отправление КАК ИС_Сбер_Отправление
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО (ИС_Сбер_Отправление.Заказ = ЗаказКлиентаТовары.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИС_Сбер_Отправление.items КАК ИС_Сбер_Отправлениеitems
		|		ПО (ИС_Сбер_Отправление.Ссылка = ИС_Сбер_Отправлениеitems.Ссылка)
		|ГДЕ
		|	ЗаказКлиентаТовары.Номенклатура.ОсобенностьУчета <> ЗНАЧЕНИЕ(Перечисление.ОсобенностиУчетаНоменклатуры.БезОсобенностейУчета)
		|	И ИС_Сбер_Отправление.Ссылка В(&Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОсновныеДанные.Номенклатура КАК Номенклатура,
		|	ВТ_ОсновныеДанные.Характеристика КАК Характеристика,
		|	ВТ_ОсновныеДанные.НоменклатураМегаМаркета КАК НоменклатураМегаМаркета,
		|	РеализацияТоваровУслугТовары.Ссылка КАК РТУ,
		|	ВТ_ОсновныеДанные.СберОтправление КАК СберОтправление
		|ПОМЕСТИТЬ ВТ_РТУ
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|		ПО (ВТ_ОсновныеДанные.ЗаказКлиента = РеализацияТоваровУслугТовары.ЗаказКлиента)
		|ГДЕ
		|	РеализацияТоваровУслугТовары.ЗаказКлиента В
		|			(ВЫБРАТЬ
		|				ВТ_ОсновныеДанные.ЗаказКлиента КАК ЗаказКлиента
		|			ИЗ
		|				ВТ_ОсновныеДанные КАК ВТ_ОсновныеДанные)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РТУ.СберОтправление КАК СберОтправление,
		|	ВТ_РТУ.НоменклатураМегаМаркета КАК НоменклатураМегаМаркета,
		|	РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.ЗначениеШтрихкода КАК ЗначениеШтрихкода
		|ИЗ
		|	ВТ_РТУ КАК ВТ_РТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.ШтрихкодыУпаковок КАК РеализацияТоваровУслугШтрихкодыУпаковок
		|		ПО (ВТ_РТУ.РТУ = РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка)
		|			И (ВТ_РТУ.Номенклатура = РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура)
		|			И (ВТ_РТУ.Характеристика = РеализацияТоваровУслугШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика)
		|ГДЕ
		|	РеализацияТоваровУслугШтрихкодыУпаковок.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_РТУ.РТУ КАК РТУ
		|			ИЗ
		|				ВТ_РТУ КАК ВТ_РТУ)";	
	КонецЕсли;
	//- ИнфоСофт Заварин К.В. 03.02.25 УА #92764
	
	Запрос.УстановитьПараметр("Ссылка", МассивОтправлений);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	КодыМаркировкиОтправлений = Новый ТаблицаЗначений;
	КодыМаркировкиОтправлений.Колонки.Добавить("СберОтправление", Новый ОписаниеТипов("ДокументСсылка.ИС_Сбер_Отправление"));
	КодыМаркировкиОтправлений.Колонки.Добавить("НоменклатураМегаМаркета", Новый ОписаниеТипов("СправочникСсылка.ИС_Сбер_Номенклатура"));
    КодыМаркировкиОтправлений.Колонки.Добавить("ЗначениеШтрихкода", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(150)));
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = КодыМаркировкиОтправлений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	Возврат КодыМаркировкиОтправлений;
	
КонецФункции //- ИнфоСофт Сумин Д.В. 19.02.2024 УА #62568

#КонецОбласти
